app/Controllers/Admin.php

     public function petugas()
    {
        $petugas = $this->petugasModel->findAll();
---
SELECT *
FROM `petugas`