app/Models/KelasModel.php

    public function countKelas(){
        $builder = $this->db->table('kelas');
        $query = $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `kelas`