app/Models/PetugasModel.php

    public function check($username, $password){
        return $this->db->table('petugas')->where(
            array(
                'username' => $username,
                'password' => $password,
            )
        )
        ->get()->getRowArray();
---
SELECT *
FROM `petugas`
WHERE `username` = 'Ramadhinta'
AND `password` = 'a036317b65f0e03c0d45845ffc07956dc7861ea4'

    public function updateUser($data, $id)
    {
        $query = $this->db->table($this->table)->update($data, array('id' => $id));
---
UPDATE `petugas` SET `nama_petugas` = 'Ramadhinta', `username` = 'Ramadhinta', `password` = 'a036317b65f0e03c0d45845ffc07956dc7861ea4', `level` = 'PETUGAS', `status` = 'AKTIF'
WHERE `id` = '2'

    public function countPetugas(){
        $builder = $this->db->table('petugas');
        $query = $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `petugas`