app/Models/SiswaModel.php

    public function checkSiswa($nisn, $nama){
        return $this->db->table('siswa')->where(
            array(
                'nisn' => $nisn,
                'nama' => $nama,
            )
        )
        ->get()->getRowArray();
---
SELECT *
FROM `siswa`
WHERE `nisn` = '24242424'
AND `nama` = 'Sasya'

    public function countSiswa(){
        $builder = $this->db->table('siswa');
        $query = $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `siswa`