app/Models/SppModel.php

    public function countSpp(){
        $builder = $this->db->table('spp');
        $query = $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `spp`