app/Models/TransaksiModel.php

SELECT COUNT(*) AS `numrows`
FROM `transaksi`
---
     public function countTrans(){
        $builder = $this->db->table('transaksi');
        $query = $builder->countAllResults();

SELECT `transaksi`.*, `spp`.*, `petugas`.`nama_petugas`
FROM `transaksi`
JOIN `spp` ON `transaksi`.`spp_id` = `spp`.`id`
JOIN `petugas` ON `transaksi`.`petugas_id` = `petugas`.`id`
WHERE `nisn` = '24242424'
---
    public function getNisn()
    {
        $nisn = session()->get('nisn'); //diganti dengan nama session nisn yang digunakan pada aplikasi
        return $this->select('transaksi.*, spp.*, petugas.nama_petugas')
        ->join('spp', 'transaksi.spp_id = spp.id')
        ->join('petugas', 'transaksi.petugas_id = petugas.id')
        ->where('nisn', $nisn)
        ->get()
        ->getResultArray();